<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Python_Data_Analytics_Course/blob/main/4_Problems/2_10_Pandas Applying Functions.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [4]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

## ðŸŸ© Convert Date to String (2.10.1)

In [7]:
df['job_posted_date_str'] = df['job_posted_date'].apply(lambda x: x.strftime('%Y-%m-%d'))

df[['job_posted_date', 'job_posted_date_str']]

           job_posted_date job_posted_date_str
0      2023-06-16 13:44:15          2023-06-16
1      2023-01-14 13:18:07          2023-01-14
2      2023-10-10 13:14:55          2023-10-10
3      2023-07-04 13:01:41          2023-07-04
4      2023-08-07 14:29:36          2023-08-07
...                    ...                 ...
785736 2023-03-13 06:16:16          2023-03-13
785737 2023-03-12 06:18:18          2023-03-12
785738 2023-03-12 06:32:36          2023-03-12
785739 2023-03-12 06:32:15          2023-03-12
785740 2023-03-13 06:16:31          2023-03-13

[785741 rows x 2 columns]

---

## ðŸŸ¨ Days Since Posted (2.10.2)

In [9]:
from datetime import datetime

In [10]:
current_date = datetime.now()

In [12]:
df['days_since_posted'] = df['job_posted_date'].apply(lambda date: (current_date - date).days)

df[['job_posted_date', 'days_since_posted']]

           job_posted_date  days_since_posted
0      2023-06-16 13:44:15                433
1      2023-01-14 13:18:07                586
2      2023-10-10 13:14:55                317
3      2023-07-04 13:01:41                415
4      2023-08-07 14:29:36                381
...                    ...                ...
785736 2023-03-13 06:16:16                528
785737 2023-03-12 06:18:18                529
785738 2023-03-12 06:32:36                529
785739 2023-03-12 06:32:15                529
785740 2023-03-13 06:16:31                528

[785741 rows x 2 columns]

---

## ðŸŸ¥ Salary Category (2.10.3)

In [15]:
df_filtered = df.dropna(subset=['salary_year_avg']).copy()

In [17]:
def salary_category(salary):
    if salary < 60000:
        return 'Low'
    elif salary > 60000 and salary < 100000:
        return 'Medium'
    else:
        return 'High'

In [18]:
df_filtered['salary_category'] = df_filtered['salary_year_avg'].apply(salary_category)
df_filtered[['salary_category', 'salary_year_avg']].head()

    salary_category  salary_year_avg
28             High         109500.0
77             High         140000.0
92             High         120000.0
100            High         228222.0
109          Medium          89000.0

In [22]:
#important

df_filtered['salary_category'] = df_filtered['salary_year_avg'].apply(lambda salary: 'Low' if salary < 60000 else 'Medium' if salary <= 100000 else 'High')

In [23]:
df_filtered[['salary_category', 'salary_year_avg']].head()

    salary_category  salary_year_avg
28             High         109500.0
77             High         140000.0
92             High         120000.0
100            High         228222.0
109          Medium          89000.0

---